app/Models/UKMModel.php

    public function getAllData()
    {
        return $this->join('tb_kontak', 'tb_ukm.id_ukm = tb_kontak.id_ukm')->findAll();
---
SELECT *
FROM `tb_ukm`
JOIN `tb_kontak` ON `tb_ukm`.`id_ukm` = `tb_kontak`.`id_ukm`

    public function getDataById($id)
    {
        return $this->join('tb_kontak', 'tb_ukm.id_ukm = tb_kontak.id_ukm')->find($id);
---
SELECT *
FROM `tb_ukm`
JOIN `tb_kontak` ON `tb_ukm`.`id_ukm` = `tb_kontak`.`id_ukm`
WHERE `tb_ukm`.`id_ukm` = '9'