app/Models/UKMModel.php

SELECT *
FROM `tb_ukm`
---
    public function getAllData()
    {
        return $this->findAll();